; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 894054 2 1 2 6 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	thermograph1 - mode
	thermograph0 - mode
	Star2 - direction
	GroundStation3 - direction
	Star5 - direction
	Star4 - direction
	Star0 - direction
	GroundStation1 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 Star0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon8)
)
(:goal (and
	(pointing satellite0 Star4)
	(have_image Planet6 thermograph1)
	(have_image Phenomenon7 thermograph0)
	(have_image Phenomenon8 thermograph0)
	(have_image Star9 thermograph0)
	(have_image Phenomenon10 thermograph0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 6
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 6
3. (turn_to satellite1 groundstation1 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 groundstation1)
   goals met: 1 of 6
4. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 1 of 6
5. (calibrate satellite1 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 1 of 6
6. (turn_to satellite0 star9 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star9)
   goals met: 0 of 6
7. (turn_to satellite1 planet6 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet6)
   goals met: 0 of 6
8. (take_image satellite1 planet6 instrument1 thermograph1)
   added: (have_image planet6 thermograph1)
   goals met: 1 of 6
9. (take_image satellite0 star9 instrument0 thermograph0)
   added: (have_image star9 thermograph0)
   goals met: 2 of 6
10. (turn_to satellite0 star4 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star4)
   goals met: 3 of 6
11. (turn_to satellite1 phenomenon7 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 phenomenon7)
   goals met: 3 of 6
12. (take_image satellite1 phenomenon7 instrument1 thermograph0)
   added: (have_image phenomenon7 thermograph0)
   goals met: 4 of 6
13. (turn_to satellite0 phenomenon8 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon8)
   goals met: 3 of 6
14. (turn_to satellite1 phenomenon10 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon10)
   goals met: 3 of 6
15. (take_image satellite0 phenomenon8 instrument0 thermograph0)
   added: (have_image phenomenon8 thermograph0)
   goals met: 4 of 6
16. (turn_to satellite0 star4 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 star4)
   goals met: 5 of 6
17. (take_image satellite1 phenomenon10 instrument1 thermograph0)
   added: (have_image phenomenon10 thermograph0)
   goals met: 6 of 6
